{
  "about": {
    "name": "about - Display detailed information about the user/portfolio owner.",
    "synopsis": "about",
    "description": "The 'about' command displays comprehensive information about Rishav Sharma, including name, title, a detailed biography, main focus areas, and links to digital presence like GitHub.",
    "arguments": "None",
    "examples": [
      "about              - Shows the full about section."
    ],
    "notes": "Output is formatted into sections: IDENTIFICATION, BIO, FOCUS, DIGITAL SELF."
  },
  "help": {
    "name": "help - Display a list of available commands and their brief descriptions.",
    "synopsis": "help",
    "description": "Lists all recognized commands that can be used in this terminal. Each command is shown with its basic syntax and a short explanation of its function.",
    "arguments": "None",
    "examples": [
      "help               - Shows the command cheatsheet."
    ],
    "notes": "For more detailed information on a specific command, try 'man <command_name>'."
  },
  "theme": {
    "name": "theme - Change or display terminal color schemes.",
    "synopsis": "theme [theme_name]",
    "description": "Switches the visual theme of the terminal and Matrix rain animation. Themes affect colors of text, backgrounds, UI elements, and the rain itself. Executing 'theme' without arguments lists available themes and the current theme.",
    "arguments": "[theme_name]: Optional. The name of the theme to apply. If omitted, current and available themes are listed.",
    "examples": [
      "theme cyan         - Switches to the cyan theme.",
      "theme              - Shows current and available themes."
    ],
    "available_themes": "amber, cyan, green (default), purple, twilight, crimson, forest, electricecho, goldenglitch, dark (reverts to green)."
  },
  "skilltree": {
    "name": "skilltree - Interactively explore a detailed hierarchy of technical skills.",
    "synopsis": "skilltree [path]",
    "description": "Displays a tree-like structure of skills. Can be used without arguments to show top-level categories or with a path to navigate to specific skill areas. Paths can be specified using skill names or their aliases.",
    "arguments": "[path]: Optional. A path to a specific skill category (e.g., 'se', 'ai > genai'). Use quotes for paths with spaces, like '\"Artificial Intelligence & Machine Learning > Core Machine Learning\"'.",
    "examples": [
      "skilltree          - Shows all top-level skill categories.",
      "skilltree se       - Shows skills under Software Engineering.",
      "skilltree ai > genai - Shows skills under Generative AI within AI.",
      "skilltree \"Data Science & Analysis\" - Shows skills under Data Science."
    ],
    "notes": "Use aliases for shorter navigation (e.g., 'se' for 'Software Engineering')."
  },
  "contact": {
    "name": "contact - Display contact information.",
    "synopsis": "contact",
    "description": "Shows various channels to get in touch, including Email, LinkedIn, GitHub, and Medium (if available). Each contact method is presented as a labeled link.",
    "arguments": "None",
    "examples": [
      "contact            - Displays all contact information."
    ]
  },
  "termopacity": {
    "name": "termopacity - Set terminal background opacity.",
    "synopsis": "termopacity <value> | reset",
    "description": "Adjusts the transparency of the terminal background. Accepts numerical values or 'reset'.",
    "arguments": "<value>: A number between 0-100 (for percentage, e.g., 75) or 0.0-1.0 (for decimal, e.g., 0.75).\nreset: Restores the terminal opacity to its default value.",
    "examples": [
      "termopacity 85     - Sets opacity to 85%.",
      "termopacity 0.5    - Sets opacity to 50%.",
      "termopacity reset  - Resets to default opacity."
    ]
  },
  "rainpreset": {
    "name": "rainpreset - Apply a predefined visual preset to the Matrix rain animation.",
    "synopsis": "rainpreset <preset_name>",
    "description": "Changes multiple Matrix rain parameters at once by applying a named preset. Use 'rainpreset' without arguments or an invalid preset name to see available presets.",
    "arguments": "<preset_name>: The name of the preset to apply (e.g., 'comet', 'storm', 'default').",
    "examples": [
      "rainpreset comet   - Applies the 'comet' rain preset.",
      "rainpreset default - Resets rain to its default configuration."
    ],
    "notes": "Available presets include: default, comet, storm, whisper, pulse, ancient. Check 'help' or an invalid 'rainpreset' call for the most current list from the system."
  }
}
